In [28]:
import pandas as pd
import numpy as np

Exercise 1: You've received a dataset containing information about students' 
performance, but the dataset has missing values across multiple columns due to 
various reasons. Your task is to analyze and handle these missing values using 
Pandas' methods.

In [29]:
import pandas as pd
import numpy as np

# Define the data dictionary
data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Grade': ['A', 'B', np.nan, 'C', 'B'],
    'Absenteeism': [2, np.nan, 5, np.nan, 1],
    'Study_Hours': [4, 6, np.nan, 3, 5]
}

# Convert the dictionary to a DataFrame
df = pd.DataFrame(data)

# # Fill missing values in 'Grade' with the mode
# df['Grade'].fillna(df['Grade'].mode()[0], inplace=True)

# # Fill missing values in 'Absenteeism' with the mean
# df['Absenteeism'].fillna(df['Absenteeism'].mean(), inplace=True)

# # Fill missing values in 'Study_Hours' with the median
# df['Study_Hours'].fillna(df['Study_Hours'].median(), inplace=True)

In [30]:
# 1. How many missing values are there in the 'Grade' column of the dataset?
df['Grade'].isnull().sum()

1

In [31]:
# 2. What is the total count of missing values in the entire dataset?
df.isnull().sum().sum()

4

In [32]:
# 3. Can you identify and display rows where 'Absenteeism' values are missing?
df[df['Absenteeism'].isnull()]

   Student_ID   Name Grade  Absenteeism  Study_Hours
1           2    Bob     B          NaN          6.0
3           4  David     C          NaN          3.0

In [33]:
# 4. How many rows have complete data (non-missing) in the 'Study Hours' column?
df['Study_Hours'].notnull().sum()

4

In [34]:
# 5. What is the sum of missing values across each column in the dataset?
# 6. How many missing values are there in each column of the dataset?
df.isnull().sum()

Student_ID     0
Name           0
Grade          1
Absenteeism    2
Study_Hours    1
dtype: int64

Exercise 2: You are analyzing a dataset containing information about employees in 
a company. However, the dataset is not entirely clean and has missing 
values in various columns due to data entry errors and incomplete 
records. Your task is to preprocess the data by handling missing values 
using Pandas' dropna() method.

In [35]:
df = pd.DataFrame({
    'Employee_ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Department': ['HR', np.nan, 'IT', 'Sales', 'Finance'],
    'Salary': [50000, 60000, np.nan, np.nan, 70000],
    'Years_Experience': [3, 5, 2, np.nan, 4],
    'Address': [np.nan, '123 Main St', '456 Elm St', np.nan, np.nan],
    'Phone': ['123456789', '987654321', np.nan, np.nan, '555555555']
})

In [36]:
# 1. How would you drop all rows with any missing values from the entire dataset using Pandas?
df.dropna(inplace=True)

In [37]:

# 2. If the 'Salary' column is critical for analysis, how can you drop only the rows where 'Salary' values are missing while reserving the rest of the dataset?
df.dropna(subset=['Salary'], inplace=True)

In [38]:
# 3. In some columns, missing values are acceptable up to a certain limit. How would you drop rows with more than two missing values across any column?
df.dropna(thresh=2, inplace=True)

In [39]:
# 4. For the 'Department' column, there are missing values that can't be imputed. How can you drop rows where 'Department' is missing while keeping rows with other missing values intact?
df.dropna(subset=['Department'], inplace=True)

In [40]:
# 5. Considering the 'Address' and 'Phone' columns have a significant number of missing values, how can you drop these columns entirely from the dataset?
df.drop(['Address', 'Phone'], axis=1, inplace=True)

In [41]:
# 6. If you want to drop rows where 'Years of Experience' are missing and 'Salary' is also missing or zero, how would you achieve this?
df.drop(df[(df['Years_Experience'].isnull()) & (
    df['Salary'].isnull())].index, inplace=True)

exercise 1: You are working as a data analyst for an e-commerce company that has a massive dataset containing customer information. The dataset has accumulated duplicate entries due to various reasons like multiple registrations, system errors, or data entry mistakes. Your task is to use the Pandas library in Python to identify and remove these duplicate entries efficiently

In [42]:

data = {
    'Customer_ID': [1, 2, 3, 4, 2, 6, 7, 8, 9, 10],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Bob', 'Eva', 'Frank', 'Grace', 'Henry', 'Alice'],
    'Email': ['alice@example.com', 'bob@example.com', 'charlie@example.com', 'david@example.com', 'bob@example.com', 'eva@example.com', 'frank@example.com', 'grace@example.com', 'henry@example.com', 'alice@example.com'],
    'Phone': ['123456789', '987654321', '111222333', '555666777', '987654321', '444555666', '888999000', '333444555', '111222333', '123456789']
}
df = pd.DataFrame(data)
df

   Customer_ID     Name                Email      Phone
0            1    Alice    alice@example.com  123456789
1            2      Bob      bob@example.com  987654321
2            3  Charlie  charlie@example.com  111222333
3            4    David    david@example.com  555666777
4            2      Bob      bob@example.com  987654321
5            6      Eva      eva@example.com  444555666
6            7    Frank    frank@example.com  888999000
7            8    Grace    grace@example.com  333444555
8            9    Henry    henry@example.com  111222333
9           10    Alice    alice@example.com  123456789

In [43]:
# # Assuming df is your DataFrame and it has been loaded with your dataset
# df.drop_duplicates(inplace=True)

# assuming last one is the latest one
df.drop_duplicates(subset=['Email', 'Phone'], inplace=True, keep='last')
df

   Customer_ID     Name                Email      Phone
2            3  Charlie  charlie@example.com  111222333
3            4    David    david@example.com  555666777
4            2      Bob      bob@example.com  987654321
5            6      Eva      eva@example.com  444555666
6            7    Frank    frank@example.com  888999000
7            8    Grace    grace@example.com  333444555
8            9    Henry    henry@example.com  111222333
9           10    Alice    alice@example.com  123456789

exercise 2: You're analyzing a sales dataset from a retail store chain that 
contains transactions from multiple branches. Due to system 
errors and data integration issues, the dataset has accumulated 
duplicate records of sales transactions. Your task is to use 
Pandas to identify these duplicates based on specific columns 
and retain only the unique transactions.

In [55]:
data = {
    'Transaction_ID': [101, 102, 103, 102, 105, 106, 107, 108, 109, 110],
    'Branch_ID': ['A', 'B', 'C', 'B', 'A', 'C', 'A', 'B', 'C', 'A'],
    'Product_ID': [501, 502, 503, 502, 505, 506, 507, 508, 509, 510],
    'Quantity': [2, 1, 3, 1, 2, 1, 4, 1, 2, 3],
    'Total_Price': [100, 50, 120, '50', '90', '30', '200', '60', '110', '180']
}

df = pd.DataFrame(data)
print("Original:")
print(df)

# You're analyzing a sales dataset from a retail store chain that contains transactions from multiple branches. Due to system errors and data integration issues, the dataset has accumulated duplicate records of sales transactions. Your task is to use Pandas to identify these duplicates based on specific columns and retain only the unique transactions.

# Convert 'Total_Price' to numeric type for consistency
df['Total_Price'] = pd.to_numeric(df['Total_Price'])

# Identify duplicate rows based on 'Transaction_ID', 'Branch_ID' and 'Product_ID'
duplicates = df.duplicated(subset=['Transaction_ID', 'Branch_ID', 'Product_ID'])

# Print duplicate rows for review
print("\nDuplicates:")
print(df[duplicates])

# Drop duplicate rows while keeping the first occurrence
df = df.drop_duplicates(subset=['Transaction_ID', 'Branch_ID', 'Product_ID'])

# Now df contains only the unique transactions
print("\nUnique:")
print(df)

Original:
   Transaction_ID Branch_ID  Product_ID  Quantity Total_Price
0             101         A         501         2         100
1             102         B         502         1          50
2             103         C         503         3         120
3             102         B         502         1          50
4             105         A         505         2          90
5             106         C         506         1          30
6             107         A         507         4         200
7             108         B         508         1          60
8             109         C         509         2         110
9             110         A         510         3         180

Duplicates:
   Transaction_ID Branch_ID  Product_ID  Quantity  Total_Price
3             102         B         502         1           50

Unique:
   Transaction_ID Branch_ID  Product_ID  Quantity  Total_Price
0             101         A         501         2          100
1             102         B         502         1           50
2             103         C         503         3          120
4             105         A         505         2           90
5             106         C         506         1           30
6             107         A         507         4          200
7             108         B         508         1           60
8             109         C         509         2          110
9             110         A         510         3          180

In [45]:
duplicates = df.duplicated(subset=['Transaction_ID', 'Branch_ID'], keep=False)
unique_transactions = df[~duplicates]
print(unique_transactions)

   Transaction_ID Branch_ID  Product_ID  Quantity Total_Price
0             101         A         501         2         100
2             103         C         503         3         120
4             105         A         505         2          90
5             106         C         506         1          30
6             107         A         507         4         200
7             108         B         508         1          60
8             109         C         509         2         110
9             110         A         510         3         180

exercise : You're working with a dataset that contains information about product sales. 
However, you've noticed that certain entries have inconsistent or incorrect values 
in the 'Category' column. You need to standardize these categories by replacing 
specific values with a unified category name using Pandas' replace() method.

In [46]:
df = pd.DataFrame({
    'Product_ID': [1, 2, 3, 4, 5],
    'Product_Name': ['Apple', 'Banana', 'Orange', 'Pear', 'Grapes'],
    'Category': ['Fruit', 'Fruit', 'Fruit', 'Veggie', 'Fruit']
})

# Print the original DataFrame
print("Original DataFrame:")
print(df)

# Replace 'Veggie' with 'Fruit' in the 'Category' column
# df['Category'] = df['Category'].replace('Veggie', 'Fruit') or
df['Category'].replace(to_replace='Veggie', value='Fruit', inplace=True)

# Print the updated DataFrame
print("\nUpdated DataFrame:\n")
print(df)

Original DataFrame:
   Product_ID Product_Name Category
0           1        Apple    Fruit
1           2       Banana    Fruit
2           3       Orange    Fruit
3           4         Pear   Veggie
4           5       Grapes    Fruit

Updated DataFrame:

   Product_ID Product_Name Category
0           1        Apple    Fruit
1           2       Banana    Fruit
2           3       Orange    Fruit
3           4         Pear    Fruit
4           5       Grapes    Fruit

In [47]:
df = pd.DataFrame({
    'A': [1, 2, None, 4],
    'B': [None, 6, 7, 8]
})

print(df['A'].count())

3

exercise : You are analyzing a dataset containing information about employees in 
a company. However, the dataset is not entirely clean and has missing 
values in various columns due to data entry errors and incomplete 
records. Your task is to preprocess the data by handling missing values 
using Pandas' dropna() method.

In [48]:
data = {
    'Employee_ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'], 'Department': ['HR', np.nan, 'IT', 'Sales', 'Finance'],
    'Salary': [50000, 60000, np.nan, np.nan, 70000],
    'Years Experience': [3, 5, 2, np.nan, 4],
    'Address': [np.nan, '123 Main St', '456 Elm St', np.nan, np.nan],
    'Phone': ['123456789', '987654321', np.nan, np.nan, '555555555']
}
df = pd.DataFrame(data)
df

,Employee_ID,Name,Department,Salary,Years Experience,Address,Phone
0,1,Alice,HR,50000.0,3.0,NaN,123456789
1,2,Bob,NaN,60000.0,5.0,123 Main St,987654321
2,3,Charlie,IT,NaN,2.0,456 Elm St,NaN
3,4,David,Sales,NaN,NaN,NaN,NaN
4,5,Eva,Finance,70000.0,4.0,NaN,555555555

In [49]:
# To drop all rows with any missing values from the entire dataset, you can use the dropna() function in pandas
df.dropna(inplace=True)
df

Empty DataFrame
Columns: [Employee_ID, Name, Department, Salary, Years Experience, Address, Phone]
Index: []

In [50]:
# If the ‘Salary’ column is critical for analysis and you want to drop only the rows where ‘Salary’ values are missing, you can use the dropna() function with the subset parameter.
df.dropna(subset=['Salary'], inplace=True)
df

Empty DataFrame
Columns: [Employee_ID, Name, Department, Salary, Years Experience, Address, Phone]
Index: []

In [51]:
# If missing values are acceptable up to a certain limit in some columns, you can use the dropna() function with the thresh parameter. This will drop rows that have less than thresh non-NA values.
df.dropna(thresh=3, inplace=True, axis=1)
df

Empty DataFrame
Columns: []
Index: []

In [52]:
# If you want to drop rows where ‘Department’ is missing while keeping rows with other missing values intact, you can use the dropna() function with the subset parameter.
df.dropna(subset=['Department'], inplace=True)
df

KeyError: ['Department']

In [ ]:
# If the ‘Address’ and ‘Phone’ columns have a significant number of missing values and you want to drop these columns entirely from the dataset, you can use the drop() function in pandas.
df.drop(['Address', 'Phone'], axis=1, inplace=True)
df

   Employee_ID     Name Department   Salary  Years Experience
0            1    Alice         HR  50000.0               3.0
1            2      Bob        NaN  60000.0               5.0
2            3  Charlie         IT      NaN               2.0
3            4    David      Sales      NaN               NaN
4            5      Eva    Finance  70000.0               4.0

In [ ]:
# If you want to drop rows where ‘Years of Experience’ are missing and ‘Salary’ is also missing or zero, you can use a combination of boolean indexing and the dropna() function.

# df.drop(df[(df['Years Experience'].isnull()) & (df['Salary'].isnull())].index, inplace=True)

# or
df.dropna(subset=['Years Experience', 'Salary'], how='all', inplace=True)
df

,Employee_ID,Name,Department,Salary,Years Experience,Address,Phone
0,1,Alice,HR,50000.0,3.0,NaN,123456789
1,2,Bob,NaN,60000.0,5.0,123 Main St,987654321
2,3,Charlie,IT,NaN,2.0,456 Elm St,NaN
4,5,Eva,Finance,70000.0,4.0,NaN,555555555

Consider a DataFrame representing student information with columns for "Name," "Age," "Grade," and "Attendance." However, due to various reasons, there are missing values in the "Age," "Grade," and "Attendance" columns:

1.Create dataframe
2.Print the original DataFrame.
3.Explore the DataFrame to identify the missing 
values.
4.Decide on an appropriate strategy for handling 
missing values in each column (e.g., mean 
imputation, forward fill, etc.).
5.Implement your chosen strategy to fill missing 
values in the DataFrame.
6.Print the DataFrame after filling missing 
values.

In [ ]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [20, np.nan, 22, np.nan, 25],
    'Grade': [80, np.nan, np.nan, 95, 88],
    'Attendance': ['Present', 'Absent', np.nan, 'Present', np.nan]
})

# 2. Print the original DataFrame[^6^][6]
print("Original DataFrame:")
print(df)

# # 3. Identify the missing values
# print("\nMissing values:")
# print(df.isnull())

# 4. Decide on an appropriate strategy for handling missing values in each column
# For 'Age' and 'Grade', we will use mean imputation
# df['Age'].fillna(df['Age'].mean(), inplace=True)
# df['Grade'].fillna(df['Grade'].mean(), inplace=True)

# For 'Attendance', we will use forward fill
# df['Attendance'].fillna(method='ffill', inplace=True)
# df

# Mean Imputation for ‘Age’ and ‘Grade’: The mean is a measure of central tendency that calculates the average of all values in a column. It’s often used for imputing missing values in columns with numerical data. If the ‘Age’ and ‘Grade’ data are normally distributed without many outliers, using the mean for imputation can be a good choice as it doesn’t drastically affect the overall distribution of the data.
# Forward Fill for ‘Attendance’: The forward fill method propagates the last observed non-null value forward until another non-null value is met. This method is suitable for data where observations have a logical order (like time-series data) or when the data doesn’t change rapidly. In the case of ‘Attendance’, if the attendance status of a student is missing, it’s reasonable to assume it’s the same as the last recorded attendance status, hence the use of forward fill.

# 5. Implement the chosen strategy to fill missing values in the DataFrame
df['Age'].fillna(df['Age'].mean(), inplace=True)
df['Grade'].fillna(df['Grade'].mean(), inplace=True)
df['Attendance'].fillna(method='ffill', inplace=True)
df

# # 6. Print the DataFrame after filling missing values
# print("\nDataFrame after filling missing values:")
# print(df)

Original DataFrame:
      Name   Age  Grade Attendance
0    Alice  20.0   80.0    Present
1      Bob   NaN    NaN     Absent
2  Charlie  22.0    NaN        NaN
3    David   NaN   95.0    Present
4      Eva  25.0   88.0        NaN

      Name        Age      Grade Attendance
0    Alice  20.000000  80.000000    Present
1      Bob  22.333333  87.666667     Absent
2  Charlie  22.000000  87.666667     Absent
3    David  22.333333  95.000000    Present
4      Eva  25.000000  88.000000    Present

Consider a DataFrame representing sales data for a company. The DataFrame contains columns for "Product", "Quantity Sold", 
"Price", and "Date". However, due to some issues, there are missing values in the "Quantity Sold" and "Price" columns. 

1.Create the dataframe as given
2.Print the original DataFrame.
3.Fill the missing values in the "Quantity 
Sold" column with the mean value of that 
column.
4.Fill the missing values in the "Price" 
column with the median value of that 
column.
5.Print the DataFrame after filling the 
missing values.

In [ ]:
# 1. Create the DataFrame
df = pd.DataFrame({
    'Product': ['A', 'B', 'C', 'D', 'E'],
    'Quantity Sold': [100, np.nan, 50, np.nan, 80],
    'Price': [20, 25, np.nan, np.nan, 30],
    'Date': pd.date_range(start='2023-01-01', periods=5)
})

# 2. Print the original DataFrame[^7^][7]
print("Original DataFrame:")
print(df)

# Mean Imputation for ‘Quantity Sold’: The mean is a measure of central tendency that calculates the average of all values in a column. It’s often used for imputing missing values in columns with numerical data. If the ‘Quantity Sold’ data is normally distributed without many outliers, using the mean for imputation can be a good choice as it doesn’t drastically affect the overall distribution of the data.
# Median Imputation for ‘Price’: The median is another measure of central tendency that represents the middle value in a sorted list of numbers. Median imputation is particularly useful when the data contains outliers, as the median is not affected by extreme values. If the ‘Price’ data has outliers (i.e., some products are significantly more expensive than others), using the median for imputation can be a more accurate choice than the mean.

# 3. Fill the missing values in the "Quantity Sold" column with the mean value of that column[^8^][8]
df['Quantity Sold'].fillna(df['Quantity Sold'].mean(), inplace=True)

# 4. Fill the missing values in the "Price" column with the median value of that column
df['Price'].fillna(df['Price'].median(), inplace=True)

# 5. Print the DataFrame after filling the missing values[^9^][9]
print("\nDataFrame after filling missing values:")
print(df)

Original DataFrame:
  Product  Quantity Sold  Price       Date
0       A          100.0   20.0 2023-01-01
1       B            NaN   25.0 2023-01-02
2       C           50.0    NaN 2023-01-03
3       D            NaN    NaN 2023-01-04
4       E           80.0   30.0 2023-01-05

DataFrame after filling missing values:
  Product  Quantity Sold  Price       Date
0       A     100.000000   20.0 2023-01-01
1       B      76.666667   25.0 2023-01-02
2       C      50.000000   25.0 2023-01-03
3       D      76.666667   25.0 2023-01-04
4       E      80.000000   30.0 2023-01-05

In [ ]:
import pandas as pd

# Define the bins
bins = [118, 125, 135, 160, 200]

# Define the data
height = [120, 122, 125, 127, 121, 123, 137, 131, 161, 145, 141, 132]

# Use pd.cut to categorize the data based on the bins
category = pd.cut(height, bins)

# Print the categorized data with right-closed bins
print("Categorized data with right-closed bins:")
print(category)

# Use pd.cut with right=False to categorize the data based on the bins with left-closed bins
category2 = pd.cut(height, bins, right=False)

# Print the categorized data with left-closed bins
print("\nCategorized data with left-closed bins:")
print(category2)

# Define the bin names
bin_names = ['Short Height', 'Average height', 'Good Height', "Taller"]

# Use pd.cut with labels=bin_names to categorize the data based on the bins and replace the bin ranges with the bin names
category = pd.cut(height, bins, labels=bin_names)

# Print the categorized data with bin names
print("\nCategorized data with bin names:")
print(category)

# Use pd.value_counts to count the number of data points in each bin
print("\nNumber of data points in each bin:")
print(pd.value_counts(category))

Categorized data with right-closed bins:
[(118, 125], (118, 125], (118, 125], (125, 135], (118, 125], ..., (125, 135], (160, 200], (135, 160], (135, 160], (125, 135]]
Length: 12
Categories (4, interval[int64, right]): [(118, 125] < (125, 135] < (135, 160] < (160, 200]]

Categorized data with left-closed bins:
[[118, 125), [118, 125), [125, 135), [125, 135), [118, 125), ..., [125, 135), [160, 200), [135, 160), [135, 160), [125, 135)]
Length: 12
Categories (4, interval[int64, left]): [[118, 125) < [125, 135) < [135, 160) < [160, 200)]

Categorized data with bin names:
['Short Height', 'Short Height', 'Short Height', 'Average height', 'Short Height', ..., 'Average height', 'Taller', 'Good Height', 'Good Height', 'Average height']
Length: 12
Categories (4, object): ['Short Height' < 'Average height' < 'Good Height' < 'Taller']

Number of data points in each bin:
Short Height      5
Average height    3
Good Height       3
Taller            1
dtype: int64

Suppose you have a DataFrame with a column of ages and you want to discretize these ages into different age groups. Assign suitable labels for each bin

In [ ]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 42, 31, 19, 50]
}
df = pd.DataFrame(data)

# Define bins for different age groups
bins = [0, 18, 30, 40, 60]

# Age groups: 0-18, 19-30, 31-40, 41-60
# Define labels for the bins
labels = ['0-18', '19-30', '31-40', '41-60']

# Discretize the 'Age' column into bins using cut() function
df['Age_Group'] = pd.cut(df['Age'], bins=bins, labels=labels)
print(df)

      Name  Age Age_Group
0    Alice   25     19-30
1      Bob   42     41-60
2  Charlie   31     31-40
3    David   19     19-30
4      Eva   50     41-60

In [ ]:
# Compute equal-length bins based on the minimum and maximum values in the data.
import numpy as np

pd.cut(np.random.rand(40), 5, precision=2)

[(0.21, 0.41], (0.21, 0.41], (0.61, 0.8], (0.8, 1.0], (0.21, 0.41], ..., (0.61, 0.8], (0.61, 0.8], (0.41, 0.61], (0.41, 0.61], (0.41, 0.61]]
Length: 40
Categories (5, interval[float64, right]): [(0.015, 0.21] < (0.21, 0.41] < (0.41, 0.61] < (0.61, 0.8] < (0.8, 1.0]]

In [ ]:
import numpy as np
import pandas as pd

# Generate 2000 random numbers between 0 and 1
randomNumbers = np.random.rand(2000)

# Discretize the random numbers into quartiles
category3 = pd.qcut(randomNumbers, 4)

# Print the quartiles
print(category3)

[(0.502, 0.744], (0.502, 0.744], (0.0017499999999999998, 0.263], (0.0017499999999999998, 0.263], (0.0017499999999999998, 0.263], ..., (0.0017499999999999998, 0.263], (0.744, 0.999], (0.502, 0.744], (0.502, 0.744], (0.502, 0.744]]
Length: 2000
Categories (4, interval[float64, right]): [(0.0017499999999999998, 0.263] < (0.263, 0.502] < (0.502, 0.744] < (0.744, 0.999]]

In [ ]:
# Importing necessary libraries
import numpy as np
import pandas as pd

# Creating a numpy array of numbers from 0 to 79
dat = np.arange(80).reshape(10, 8)

# Converting the numpy array to a pandas DataFrame
df = pd.DataFrame(dat)

# Generating a random permutation of integers from 0 to 9
sampler = np.random.permutation(10)

# Taking a random sample of 3 rows from the DataFrame
sampled_rows = df.take(np.random.permutation(len(df))[:3])

# Creating a numpy array with specific values
sack = np.array([4, 8, -2, 7, 5])

# Generating 10 random integers in the range of the length of 'sack'
sampler = np.random.randint(0, len(sack), size=10)

# Using the random integers as indices to take elements from 'sack'
draw = sack.take(sampler)

In [ ]:
import pandas as pd

# Creating a sample DataFrame
data = {
    'Student_ID': range(1, 21),
    'Test_Score': [82, 85, 88, 90, 85, 95, 78, 85, 100, 92, 85, 87, 80, 98, 85, 82, 85, 87, 88, 91]
}
df = pd.DataFrame(data)

# Performing random sampling to select 5 students randomly
sampled_data = df.sample(n=5, random_state=42)

# Specifying random_state for reproducibility
print("Randomly Sampled Data:")
print(sampled_data)

In [ ]:
import pandas as pd
# Creating a sample DataFrame
data = {
    'A': [1, 2, 3, 4, 5],
    'B': ['a', 'b', 'c', 'd', 'e']
}
df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

print("\n")
# Example 1: Sample 2 random rows
sampled_rows = df.sample(n=2)
print("Sampled 2 random rows:")
print(sampled_rows)

# Example 2: Sample 30% of the rows
sampled_frac = df.sample(frac=0.3)
print("\nSampled 30% of the rows:")
print(sampled_frac)

# Example 3: Sample with replacement
sampled_with_replace = df.sample(n=5, replace=True)
print("\nSampled with replacement:")
print(sampled_with_replace)

Original DataFrame:
   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e


Sampled 2 random rows:
   A  B
3  4  d
4  5  e

Sampled 30% of the rows:
   A  B
1  2  b
2  3  c

Sampled with replacement:
   A  B
0  1  a
3  4  d
0  1  a
0  1  a
0  1  a

In [ ]:
import pandas as pd
import numpy as np

# Create a DataFrame
data = {
    'Customer_ID': range(1, 101),  # Customer IDs from 1 to 100
    'Age': np.random.randint(18, 70, size=100),  # Random ages
    'Gender': ['M', 'F'] * 50,  # Alternating 'M' and 'F'
    # Random purchase amounts
    'Purchase_Amount': np.random.randint(1, 500, size=100)
}

df = pd.DataFrame(data)

# Perform random sampling to select 20 customers
sampled_df = df.sample(n=20)

print(sampled_df)

    Customer_ID  Age Gender  Purchase_Amount
54           55   65      M               48
55           56   63      F              382
97           98   18      F              230
6             7   43      M              486
67           68   68      F              175
66           67   18      M              250
51           52   29      F               76
32           33   66      M              381
33           34   50      F              423
68           69   51      M              251
58           59   29      M              197
92           93   50      M               13
40           41   64      M              463
28           29   60      M              406
34           35   43      M              126
10           11   69      M              112
81           82   65      F               19
11           12   23      F              463
20           21   56      M              117
22           23   23      M              398

In [ ]:
import pandas as pd
import numpy as np

# Create a DataFrame
data = {
    'Customer_ID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Age': [25, 32, 45, 23, 35, 65, 37, 29, 42, 59],
    'Gender': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F', 'M', 'F'],
    'Purchase_Amount': [100, 120, 150, 200, 210, 75, 90, 175, 180, 205]
}

df = pd.DataFrame(data)
print("\noriginal:")
print(df)

stacked = df.stack()
print("\nstacked:")
print(stacked)

unstacked = stacked.unstack()
print("\nunstacked:")
print(unstacked)

original:
   Customer_ID  Age Gender  Purchase_Amount
0            1   25      M              100
1            2   32      F              120
2            3   45      M              150
3            4   23      M              200
4            5   35      F              210
5            6   65      F               75
6            7   37      M               90
7            8   29      F              175
8            9   42      M              180
9           10   59      F              205

stacked:
0  Customer_ID          1
   Age                 25
   Gender               M
   Purchase_Amount    100
1  Customer_ID          2
   Age                 32
   Gender               F
   Purchase_Amount    120
2  Customer_ID          3
   Age                 45
   Gender               M
   Purchase_Amount    150
3  Customer_ID          4
   Age                 23
   Gender               M
   Purchase_Amount    200
4  Customer_ID          5
   Age                 35
   Gender               F
   Purchase_Amount    210
5  Customer_ID          6
   Age                 65
   Gender               F
   Purchase_Amount     75
6  Customer_ID          7
   Age                 37
   Gender               M
   Purchase_Amount     90
7  Customer_ID          8
   Age                 29
   Gender               F
   Purchase_Amount    175
8  Customer_ID          9
   Age                 42
   Gender               M
   Purchase_Amount    180
9  Customer_ID         10
   Age                 59
   Gender               F
   Purchase_Amount    205
dtype: object

unstacked:
  Customer_ID Age Gender Purchase_Amount
0           1  25      M             100
1           2  32      F             120
2           3  45      M             150
3           4  23      M             200
4           5  35      F             210
5           6  65      F              75
6           7  37      M              90
7           8  29      F             175
8           9  42      M             180
9          10  59      F             205